Project/Toir/src/Catalogs/гкс_ПКоэффициентыРабот/гкс_ПКоэффициентыРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ПКоэффициентыРабот</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПоУмолчанию</name>
      <description>По умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/гкс_ПКоэффициентыРабот/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если Ссылка = Справочники.гкс_ПКоэффициентыРабот.ПоУмолчанию Тогда 
		Коэффициент = 1;
	Иначе
		Если Коэффициент = 0 Тогда 
			Коэффициент = 1;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
